function [output_data_row, half_turbo_interleve_pattern] = turbo_interlever_common(input_data_row, PB_type, spec_version)
%======================================================================================================================%
% Description:
%   turbo_interlever_common()为Turbo交织模块
% Inputs:
%   input_data_row : 输入比特序列, 行向量(特别注意若输入的是索引, 则得到了Turbo交织模式)
%   PB_type        : PB类型, {16, 136, 520}
%   spec_version   : 协议版本
% Outputs:
%   output_data_row              : Turbo编码后的输出比特序列, 行向量
%   half_turbo_interleve_pattern : Turbo半交织模式
%**********************************************************************************************************************%
% Author: lixinan                                                                                      Date: 2025.09.06
%======================================================================================================================%

%% 基本参数初始化
% N : S查找表的长度
% M = L / N, 表中列了但是用不到
% L : 双比特的交织长度, PB_type*8/2
if strcmp(spec_version, 'IEEE1901')
    if PB_type == 16
        N = 8;
        L = 64;
        S = [53, 20, 9, 32, 62, 39, 51, 18];
    elseif PB_type == 72
        N = 18;
        L = 288;
        S = [1, 200, 255, 166, 221, 132, 187, 98, 153, 64, 119, 30, 85, 284, 51, 250, 17, 216];
    elseif PB_type == 136
        N = 34;
        L = 544;
        S = [383, 68, 262, 180, 484, 363, 302, 152, 405, 529, 97, 11, 333, 509, 40, 198, 236, 454, 428, 124, ...
            273, 493, 73, 389, 162, 293, 2, 211, 467, 252, 411, 183, 310, 86];
    elseif PB_type == 520
        N = 40;
        L = 2080;
        S = [1183, 32, 425, 1434, 165, 331, 1574, 1039, 1084, 1332, 1513, 536, 213, 1908, 761, 1231, 1659, 476, ...
            1842, 809, 2007, 895, 1717, 1950, 101, 937, 618, 1606, 704, 1786, 570, 843, 349, 2038, 1102, 1260, ...
            235, 40, 648, 1347];
    else
        error('[ERROR] IEEE Invalid PB_type');
    end
elseif strcmp(spec_version, 'SG1P0') || strcmp(spec_version, 'SG2P0')
    if PB_type == 16
        N = 8;
        L = 64;
        S = [53, 20, 9, 32, 62, 39, 51, 18];
    elseif PB_type == 40
        N = 8;
        L = 160;
        S = [156, 65, 138, 47, 86, 13, 99, 112];
    elseif PB_type == 72
        N = 18;
        L = 288;
        S = [1, 200, 255, 166, 221, 132, 187, 98, 153, 64, 119, 30, 85, 284, 51, 250, 17, 216];
    elseif PB_type == 136
        N = 34;
        L = 544;
        S = [383, 68, 262, 180, 484, 363, 302, 152, 405, 529, 97, 11, 333, 509, 40, 198, 236, 454, 428, 124, ...
            273, 493, 73, 389, 162, 293, 2, 211, 467, 252, 411, 183, 310, 86];
    elseif PB_type == 264
        N = 33;
        L = 1056;
        S = [309, 175, 737, 667, 1024, 224, 622, 962, 527, 845, 926, 1052, 366, 54, 249, 784, 108, 551, 410, ...
            479, 823, 866, 442, 654, 321, 33, 85, 610, 730, 765, 1038, 352, 954];
    elseif PB_type == 520
        N = 40;
        L = 2080;
        S = [1183, 32, 425, 1434, 165, 331, 1574, 1039, 1084, 1332, 1513, 536, 213, 1908, 761, 1231, 1659, 476, ...
            1842, 809, 2007, 895, 1717, 1950, 101, 937, 618, 1606, 704, 1786, 570, 843, 349, 2038, 1102, 1260, ...
            235, 40, 648, 1347];
    else
        error('[ERROR] SG Invalid PB_type');
    end
elseif strcmp(spec_version, 'SPG1P0') || strcmp(spec_version, 'SPG2P0')
    if PB_type == 16
        N = 8;
        L = 64;
        S = [54, 23, 61, 12, 35, 2, 40, 25];
    elseif PB_type == 72
        N = 18;
        L = 288;
        S = [1, 200, 255, 166, 221, 132, 187, 98, 153, 64, 119, 30, 85, 284, 51, 250, 17, 216];
    elseif PB_type == 136
        N = 34;
        L = 544;
        S = [369, 235, 338, 436, 169, 200, 397, 59, 298, 20, 265, 429, 294, 466, 16, 48, ...
            525, 461, 187, 86, 216, 387, 41, 142, 247, 314, 79, 486, 512, 103, 476, 345, 4, 105];
    elseif PB_type == 264
        N = 33;
        L = 1056;
        S = [309, 175, 737, 667, 1024, 224, 622, 962, 527, 845, 926, 1052, 366, 54, 249, 784, 108, 551, 410, ...
            479, 823, 866, 442, 654, 321, 33, 85, 610, 730, 765, 1038, 352, 954];
    elseif PB_type == 520
        N = 40;
        L = 2080;
        S = [1558, 1239, 315, 1114, 437, 956, 871, 790, 833, 1152, 147, 506, 589, 388, 1584, 265, ...
            981, 220, 1183, 102, 1258, 1019, 1296, 737, 694, 1495, 612, 453, 1049, 1450, 531, 47, ...
            1368, 645, 166, 322, 1323, 1404, 0, 881];
    else
        error('[ERROR] SPG Invalid PB_type');
    end
else
    error('[ERROR] Do not support this standard version');
end


%% Turbo半交织模式
x = 0 : L-1;
I = mod(S(mod(x, N)+1) - floor(x/N)*N + L, L);
half_turbo_interleve_pattern = I + 1;


%% Turbo交织
input_data_matrix = reshape(input_data_row, 2, []);  % 第1行是u1, 第2行是u2
output_data_matrix = input_data_matrix(:, half_turbo_interleve_pattern);  % Turbo半交织
for x = 0:L-1
    if mod(x,2) == 0  % 偶数索引交换u1和u2
        temp = output_data_matrix(1, x+1);
        output_data_matrix(1, x+1) = output_data_matrix(2, x+1);
        output_data_matrix(2, x+1) = temp;
    end
end
output_data_row = reshape(output_data_matrix, 1, []);


end